app/controllers/flights_controller.rb

SELECT * FROM "flights" WHERE ("flights"."id" = 1)
---
  def show
    @flight = Flight.find(params[:id])

SELECT * FROM "flights" WHERE ("flights"."id" = 1)
---
  def edit
    @flight = Flight.find(params[:id])

INSERT INTO "flights" ("departure", "created_at", "destination", "updated_at", "arrival", "baggage_allowance", "capacity") VALUES('2010-07-28', '2010-07-28 07:24:32', 'Tokyo', '2010-07-28 07:24:32', '2010-07-28', 3000.0, 5)
---
  def create
    @flight = Flight.new(params[:flight])

    respond_to do |format|
      if @flight.save