app/controllers/seats_controller.rb

  def show
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 1)

  def edit
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 11)

  def create
    @seat = Seat.new(params[:seat])

    respond_to do |format|
      if @seat.save
---
INSERT INTO "seats" ("name", "flight_id", "created_at", "baggage", "updated_at") VALUES('Bud', 99, '2010-07-29 16:15:40', 2.0, '2010-07-29 16:15:40')

  def update
    @seat = Seat.find(params[:id])

    respond_to do |format|
      if @seat.update_attributes(params[:seat])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 11)
UPDATE "seats" SET "updated_at" = '2010-07-31 19:41:57', "baggage" = 9.0 WHERE "id" = 11